bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_ethmac.c
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include <string.h>
#include "FreeRTOS.h"
#include "task.h"

#include "bl808_ethmac.h"

#include "mii.h"
#include "mdio.h"


#define BIT(nr)			(1UL << (nr))
#define NUM_TX_BD       1

#define ETH_RXBUFNB     7
#define ETH_TXBUFNB     (NUM_TX_BD)

#define PHY_AUTONEGOTIATE_TIMEOUT 5000

#define MII_MARVELL_PHY_PAGE		22

/* 88E1011 PHY Status Register */
#define MIIM_88E1xxx_PHY_STATUS		0x11
#define MIIM_88E1xxx_PHYSTAT_SPEED	0xc000
#define MIIM_88E1xxx_PHYSTAT_GBIT	0x8000
#define MIIM_88E1xxx_PHYSTAT_100	0x4000
#define MIIM_88E1xxx_PHYSTAT_DUPLEX	0x2000
#define MIIM_88E1xxx_PHYSTAT_SPDDONE	0x0800
#define MIIM_88E1xxx_PHYSTAT_LINK	0x0400

#define MIIM_88E1xxx_PHY_SCR		0x10
#define MIIM_88E1xxx_PHY_MDI_X_AUTO	0x0060

/* 88E1111 PHY LED Control Register */
#define MIIM_88E1111_PHY_LED_CONTROL	24
#define MIIM_88E1111_PHY_LED_DIRECT	0x4100
#define MIIM_88E1111_PHY_LED_COMBINE	0x411C

/* 88E1111 Extended PHY Specific Control Register */
#define MIIM_88E1111_PHY_EXT_CR		0x14
#define MIIM_88E1111_RX_DELAY		0x80
#define MIIM_88E1111_TX_DELAY		0x2

/* 88E1111 Extended PHY Specific Status Register */
#define MIIM_88E1111_PHY_EXT_SR		0x1b
#define MIIM_88E1111_HWCFG_MODE_MASK		0xf
#define MIIM_88E1111_HWCFG_MODE_COPPER_RGMII	0xb
#define MIIM_88E1111_HWCFG_MODE_FIBER_RGMII	0x3
#define MIIM_88E1111_HWCFG_MODE_SGMII_NO_CLK	0x4
#define MIIM_88E1111_HWCFG_MODE_COPPER_RTBI	0x9
#define MIIM_88E1111_HWCFG_FIBER_COPPER_AUTO	0x8000
#define MIIM_88E1111_HWCFG_FIBER_COPPER_RES	0x2000

#define MIIM_88E1111_COPPER		0
#define MIIM_88E1111_FIBER		1

/* 88E1118 PHY defines */
#define MIIM_88E1118_PHY_PAGE		22
#define MIIM_88E1118_PHY_LED_PAGE	3

/* 88E1121 PHY LED Control Register */
#define MIIM_88E1121_PHY_LED_CTRL	16
#define MIIM_88E1121_PHY_LED_PAGE	3
#define MIIM_88E1121_PHY_LED_DEF	0x0030

/* 88E1121 PHY IRQ Enable/Status Register */
#define MIIM_88E1121_PHY_IRQ_EN		18
#define MIIM_88E1121_PHY_IRQ_STATUS	19

#define MIIM_88E1121_PHY_PAGE		22

/* 88E1145 Extended PHY Specific Control Register */
#define MIIM_88E1145_PHY_EXT_CR 20
#define MIIM_M88E1145_RGMII_RX_DELAY	0x0080
#define MIIM_M88E1145_RGMII_TX_DELAY	0x0002

#define MIIM_88E1145_PHY_LED_CONTROL	24
#define MIIM_88E1145_PHY_LED_DIRECT	0x4100

#define MIIM_88E1145_PHY_PAGE	29
#define MIIM_88E1145_PHY_CAL_OV 30

#define MIIM_88E1149_PHY_PAGE	29

/* 88E1310 PHY defines */
#define MIIM_88E1310_PHY_LED_CTRL	16
#define MIIM_88E1310_PHY_IRQ_EN		18
#define MIIM_88E1310_PHY_RGMII_CTRL	21
#define MIIM_88E1310_PHY_PAGE		22

/* 88E151x PHY defines */
/* Page 2 registers */
#define MIIM_88E151x_PHY_MSCR		21
#define MIIM_88E151x_RGMII_RX_DELAY	BIT(5)
#define MIIM_88E151x_RGMII_TX_DELAY	BIT(4)
#define MIIM_88E151x_RGMII_RXTX_DELAY	(BIT(5) | BIT(4))
/* Page 3 registers */
#define MIIM_88E151x_LED_FUNC_CTRL	16
#define MIIM_88E151x_LED_FLD_SZ		4
#define MIIM_88E151x_LED0_OFFS		(0 * MIIM_88E151x_LED_FLD_SZ)
#define MIIM_88E151x_LED1_OFFS		(1 * MIIM_88E151x_LED_FLD_SZ)
#define MIIM_88E151x_LED0_ACT		3
#define MIIM_88E151x_LED1_100_1000_LINK	6
#define MIIM_88E151x_LED_TIMER_CTRL	18
#define MIIM_88E151x_INT_EN_OFFS	7
/* Page 18 registers */
#define MIIM_88E151x_GENERAL_CTRL	20
#define MIIM_88E151x_MODE_SGMII		1
#define MIIM_88E151x_RESET_OFFS		15


/* Common PHY Registers */
#define PHY_BCR                                         ((uint16_t)0x00U)    /*!< Transceiver Basic Control Register   */
#define PHY_BSR                                         ((uint16_t)0x01U)    /*!< Transceiver Basic Status Register    */
#    define PHY_BSR_100BASETXFULL                       (1 << 14)
#    define PHY_BSR_100BASETXHALF                       (1 << 13)
#    define PHY_BSR_10BASETXFULL                        (1 << 12)
#    define PHY_BSR_10BASETXHALF                        (1 << 11)
#define PHY_RESET                                       ((uint16_t)0x8000U)  /*!< PHY Reset */
#define PHY_LOOPBACK                                    ((uint16_t)0x4000U)  /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M                             ((uint16_t)0x2100U)  /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M                             ((uint16_t)0x2000U)  /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M                              ((uint16_t)0x0100U)  /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M                              ((uint16_t)0x0000U)  /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION                             ((uint16_t)0x1000U)  /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION                     ((uint16_t)0x0200U)  /*!< Restart auto-negotiation function    */
#define PHY_POWERDOWN                                   ((uint16_t)0x0800U)  /*!< Select the power down mode           */
#define PHY_ISOLATE                                     ((uint16_t)0x0400U)  /*!< Isolate PHY from MII                 */
#define PHY_AUTONEGO_COMPLETE                           ((uint16_t)0x0020U)  /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS                               ((uint16_t)0x0004U)  /*!< Valid link established               */
#define PHY_JABBER_DETECTION                            ((uint16_t)0x0002U)  /*!< Jabber condition detected            */

#define PHY_PHYID1                                      ((uint16_t)0x02U)    /*!< PHY ID 1    */
#define PHY_PHYID2                                      ((uint16_t)0x03U)    /*!< PHY ID 2    */
#define PHY_ADVERTISE                                   ((uint16_t)0x04U)    /*!< Auto-negotiation advertisement       */
#    define PHY_ADVERTISE_100BASETXFULL                 (1 << 8)
#    define PHY_ADVERTISE_100BASETXHALF                 (1 << 7)
#    define PHY_ADVERTISE_10BASETXFULL                  (1 << 6)
#    define PHY_ADVERTISE_10BASETXHALF                  (1 << 5)
#    define PHY_ADVERTISE_8023                          (1 << 0)
#define PHY_LPA                                         ((uint16_t)0x05U)    /*!< Auto-negotiation link partner base page ability    */
#define PHY_EXPANSION                                   ((uint16_t)0x06U)    /*!< Auto-negotiation expansion           */
/* Section 4: Extended PHY Registers */
#define PHY_SR                                          ((uint16_t)0x1FU)    /*!< PHY special control/ status register Offset     */
#    define PHY_SR_SPEED_OFFSET                         (2)
#    define PHY_SR_SPEED_MASK                           (0x7 << PHY_SR_SPEED_OFFSET)
#    define PHY_SR_SPEED_10BASETXHALF                   (0x1 << PHY_SR_SPEED_OFFSET)
#    define PHY_SR_SPEED_10BASETXFULL                   (0x5 << PHY_SR_SPEED_OFFSET)
#    define PHY_SR_SPEED_100BASETXHALF                  (0x2 << PHY_SR_SPEED_OFFSET)
#    define PHY_SR_SPEED_100BASETXFULL                  (0x6 << PHY_SR_SPEED_OFFSET)
#    define PHY_SR_SPEED_MODE_COMPARE(status, mode)     (!!(mode == (status & PHY_SR_SPEED_MASK)))
#define PHY_SPEED_STATUS                                ((uint16_t)0x0004U)  /*!< PHY Speed mask                                  */
#define PHY_DUPLEX_STATUS                               ((uint16_t)0x0010U)  /*!< PHY Duplex mask                                 */
#define PHY_ISFR                                        ((uint16_t)0x1DU)    /*!< PHY Interrupt Source Flag register Offset       */
#define PHY_ISFR_INT4                                   ((uint16_t)0x0010U)  /*!< PHY Link down inturrupt                         */

#define PHY_MAX_RETRY                                   (0x3FFF)
#define ETH_MAX_PACKET_SIZE                             (1536 + 16)

/* TODO: formalize MMU mapping later */
#define EMAC_DMA_MAPPING_OFFSET   0//(0xCF000000 - 0x3F000000) /*FIXME :if MMU enable should add memory map*/

ETHMAC_Handle_Type ethHandle;
static ETHMAC_Handle_Type *thiz = NULL;

/* TODO: ethRxBuff and ethTxBuff MUST in VRAM */
/* TODO: malloc */
/* Ethernet Receive Buffers */
static volatile uint8_t ethRxBuff[ETH_RXBUFNB][ETH_MAX_PACKET_SIZE] __attribute__ ((aligned(16), section(".fgpa_ddr")));
/* Ethernet Transmit Buffers */
static volatile uint8_t ethTxBuff[ETH_TXBUFNB][ETH_MAX_PACKET_SIZE] __attribute__ ((aligned(16), section(".fgpa_ddr")));

static int phy_read(phy_device *phydev, uint8_t regnum)
{
    int val;
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    ethmac_reg->MIIADDRESS.BF.FIAD = phydev->addr;
    ethmac_reg->MIIADDRESS.BF.RGAD = regnum;

    /* kick off the read operation */
    ethmac_reg->MIICOMMAND.BF.RSTAT = 1;

    vTaskDelay(10); // delay 10 ms
    /* poll until MII is not busy */
    while (ethmac_reg->MIISTATUS.BF.MIIM_BUSY == 1);

    val = ethmac_reg->MIIRX_DATA.BF.PRSD;
        
    printf("phy_read[%d], val 0x%04x\r\n", regnum, val);

    return val;
}

static int phy_write(phy_device *phydev, uint8_t regnum, uint16_t val)
{
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    ethmac_reg->MIIADDRESS.BF.FIAD = phydev->addr;
    ethmac_reg->MIIADDRESS.BF.RGAD = regnum;

