bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_ethmac.c
	if ((phydev->autoneg == AUTONEG_ENABLE) &&
	    !(mii_reg & BMSR_ANEGCOMPLETE)) {
		int i = 0;

		printf("Waiting for PHY auto negotiation to complete\r\n");
		while (!(mii_reg & BMSR_ANEGCOMPLETE)) {
			/*
			 * Timeout reached ?
			 */
			if (i > PHY_ANEG_TIMEOUT) {
				printf(" TIMEOUT !\r\n");
				phydev->link = 0;
				return -1;
			}

			if ((i++ % 500) == 0)
				puts(".");

			vTaskDelay(1);	/* 1 ms */
			mii_reg = phy_read(phydev, MII_BMSR);
		}
		printf(" done\r\n");
		phydev->link = 1;
	} else {
		/* Read the link a second time to clear the latched state */
		mii_reg = phy_read(phydev, MII_BMSR);

		if (mii_reg & BMSR_LSTATUS)
			phydev->link = 1;
		else
			phydev->link = 0;
	}

	return 0;
}


/* Parse the 88E1011's status register for speed and duplex
 * information
 */
static int m88e1xxx_parse_status(phy_device *phydev)
{
	unsigned int speed;
	unsigned int mii_reg;

	mii_reg = phy_read(phydev, MIIM_88E1xxx_PHY_STATUS);

	if ((mii_reg & MIIM_88E1xxx_PHYSTAT_LINK) &&
	    !(mii_reg & MIIM_88E1xxx_PHYSTAT_SPDDONE)) {
		int i = 0;

		printf("Waiting for PHY realtime link");
		while (!(mii_reg & MIIM_88E1xxx_PHYSTAT_SPDDONE)) {
			/* Timeout reached ? */
			if (i > PHY_AUTONEGOTIATE_TIMEOUT) {
				printf(" TIMEOUT !\r\n");
				phydev->link = 0;
				return -1;
			}

			if ((i++ % 1000) == 0)
				puts(".");
			vTaskDelay(1);
			mii_reg = phy_read(phydev, MIIM_88E1xxx_PHY_STATUS);
		}
		printf(" done\r\n");
		vTaskDelay(500);	/* another 500 ms (results in faster booting) */
	} else {
		if (mii_reg & MIIM_88E1xxx_PHYSTAT_LINK)
			phydev->link = 1;
		else
			phydev->link = 0;
	}

    printf("PHY link is %d\r\n", phydev->link);

	if (mii_reg & MIIM_88E1xxx_PHYSTAT_DUPLEX)
		phydev->duplex = DUPLEX_FULL;
	else
		phydev->duplex = DUPLEX_HALF;

    printf("PHY duplex is %d\r\n", phydev->duplex);

	speed = mii_reg & MIIM_88E1xxx_PHYSTAT_SPEED;

	switch (speed) {
	case MIIM_88E1xxx_PHYSTAT_GBIT:
		phydev->speed = SPEED_1000;
        printf("PHY speed 1000\r\n");
		break;
	case MIIM_88E1xxx_PHYSTAT_100:
		phydev->speed = SPEED_100;
        printf("PHY speed 100\r\n");
		break;
	default:
		phydev->speed = SPEED_10;
        printf("PHY speed 10\r\n");
		break;
	}

	return 0;
}


int M88e1111s_startup(phy_device *phydev)
{
	int ret;

	ret = genphy_update_link(phydev);
	if (ret)
		return ret;

	return m88e1xxx_parse_status(phydev);
}

/* Marvell 88E1111S */
int M88e1111s_config(phy_device *phydev)
{
	/* soft reset */
	phy_reset(phydev);

	genphy_config_aneg(phydev);
	//genphy_restart_aneg(phydev);

    phy_write(phydev, 18, 0xffff);

	return 0;
}

static int ETHMAC_Phy_AutoNegotiate(phy_device *phydev)
{
	uint16_t id1, id2;
    volatile uint16_t regval = 0;
    uint16_t advertise = 0;
    uint16_t lpa = 0;
    uint32_t timeout = PHY_MAX_RETRY;

    id1 = phy_read(phydev, PHY_PHYID1);
    id2 = phy_read(phydev, PHY_PHYID2);
	  printf("PHY %x:%x\r\n", id1, id2);

    regval = phy_read(phydev, PHY_BCR);

    regval &= ~PHY_AUTONEGOTIATION;
    regval &= ~(PHY_LOOPBACK | PHY_POWERDOWN);
    regval |= PHY_ISOLATE;
    if(phy_write(phydev, PHY_BCR, regval) != 0){
        return -1;
    }

    /* set advertisement mode */
    advertise = PHY_ADVERTISE_100BASETXFULL | PHY_ADVERTISE_100BASETXHALF |
             PHY_ADVERTISE_10BASETXFULL | PHY_ADVERTISE_10BASETXHALF |
             PHY_ADVERTISE_8023;
    if(phy_write(phydev, PHY_ADVERTISE, advertise) != 0){
        return -1;
    }

    vTaskDelay(16);
    regval = phy_read(phydev, PHY_BCR);

    vTaskDelay(16);
    regval |= (PHY_FULLDUPLEX_100M | PHY_AUTONEGOTIATION);
    if(phy_write(phydev, PHY_BCR, regval) != 0){
        return -1;
    }

    regval |= PHY_RESTART_AUTONEGOTIATION;
    regval &= ~PHY_ISOLATE;
    if(phy_write(phydev, PHY_BCR, regval) != 0){
        return -1;
    }

    vTaskDelay(16);
    while(1) {
        regval = phy_read(phydev, PHY_BSR);

        if (regval & PHY_AUTONEGO_COMPLETE) {
            /* complete */
            break;
        }

        if (!(--timeout)) {
            return -2;
        }
    }

    vTaskDelay(16);
    lpa = phy_read(phydev, PHY_LPA);

    if (((advertise & lpa) & PHY_ADVERTISE_100BASETXFULL) != 0)
    {
        /* 100BaseTX and Full Duplex */
        phydev->duplex = DUPLEX_FULL;
        phydev->speed = SPEED_100;
    }
    else if (((advertise & lpa) & PHY_ADVERTISE_10BASETXFULL) != 0)
    {
        /* 10BaseT and Full Duplex */
        phydev->duplex = DUPLEX_FULL;
        phydev->speed = SPEED_10;
    }
    else if (((advertise & lpa) & PHY_ADVERTISE_100BASETXHALF) != 0)
    {
        /* 100BaseTX and half Duplex */
        phydev->duplex = DUPLEX_HALF;
        phydev->speed = SPEED_100;
    }
    else if (((advertise & lpa) & PHY_ADVERTISE_10BASETXHALF) != 0)
    {
        /* 10BaseT and half Duplex */
        phydev->duplex = DUPLEX_HALF;
        phydev->speed = SPEED_10;
    }

    return 0;
}

static int ETHMAC_Phy_Linkup(phy_device *phydev)
{
    uint16_t phy_bsr = 0;
    uint16_t phy_sr = 0;

    vTaskDelay(16);
    phy_bsr = phy_read(phydev, PHY_BSR);

    vTaskDelay(16);
    if (!(PHY_LINKED_STATUS & phy_bsr)) {
        return -1;
    }

    vTaskDelay(16);
    phy_sr = phy_read(phydev, PHY_SR);

    if ((phy_bsr & PHY_BSR_100BASETXFULL) && PHY_SR_SPEED_MODE_COMPARE(phy_sr, PHY_SR_SPEED_100BASETXFULL)) {
        /* 100BaseTX and Full Duplex */
        phydev->duplex = DUPLEX_FULL;
        phydev->speed = SPEED_100;
    } else if ((phy_bsr & PHY_BSR_10BASETXFULL) && PHY_SR_SPEED_MODE_COMPARE(phy_sr, PHY_SR_SPEED_10BASETXFULL)) {
        /* 10BaseT and Full Duplex */
        phydev->duplex = DUPLEX_FULL;
        phydev->speed = SPEED_10;
    } else if ((phy_bsr & PHY_BSR_100BASETXHALF) && PHY_SR_SPEED_MODE_COMPARE(phy_sr, PHY_SR_SPEED_100BASETXHALF)) {
        /* 100BaseTX and half Duplex */
        phydev->duplex = DUPLEX_HALF;
        phydev->speed = SPEED_100;
    } else if ((phy_bsr & PHY_BSR_10BASETXHALF) && PHY_SR_SPEED_MODE_COMPARE(phy_sr, PHY_SR_SPEED_10BASETXHALF)) {
        /* 10BaseT and half Duplex */
        phydev->duplex = DUPLEX_HALF;
        phydev->speed = SPEED_10;
    }

