bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_ethmac.c
#if 0
    if (SUCCESS != EMAC_Phy_Read(PHY_BCR, &phy_bsr)) {
        return ERROR;
    }

    /* enter test mode: near-end loopback */
    BL702_Delay_MS(16);
    phy_bsr |= PHY_LOOPBACK;
    if(EMAC_Phy_Write(PHY_BCR, phy_bsr) != SUCCESS){
        return ERROR;
    }

    if (SUCCESS != EMAC_Phy_Read(PHY_BCR, &phy_bsr)) {
        return ERROR;
    }
#endif

#if 0
    if (SUCCESS != EMAC_Phy_Read(17, &phy_bsr)) {
        return ERROR;
    }

    /* enter test mode: far loopback */
    BL702_Delay_MS(16);
    phy_bsr |= (1 << 9); /* mode control/status register, FARLOOPBACK bit */
    if(EMAC_Phy_Write(17, phy_bsr) != SUCCESS){
        return ERROR;
    }
#endif

    return 0;
}

int ETHMAC_PhyInit(phy_device *phydev)
{
    if (AUTONEG_ENABLE == phydev->autoneg) {
        ETHMAC_Phy_AutoNegotiate(phydev);
    } else {
        printf("%s:%d:not implemented\n\r", __func__, __LINE__);
        return -1;
    }

    /*
     *TODO: set ETHMAC control reg accroding to negotiation results,
     * such as the duplex.
     */

    ETHMAC_Phy_Linkup(phydev);

    return 0;
}

int ETHMAC_Cfg(phy_device *phydev)
{
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    ethmac_reg->TX_BD_NUM.BF.TXBDNUM = NUM_TX_BD;

    ethmac_reg->INT_MASK.WORD   = 0xFFFFFFFF;   /* mask  all interrupts */
    ethmac_reg->INT_SOURCE.WORD = 0xFFFFFFFF;   /* clear all interrupts */
    
    ethmac_reg->MODE.BF.RMIIEN = (true == phydev->is_rmii) ? 1 : 0;
    ethmac_reg->MODE.BF.RECSMALL = 0;
    ethmac_reg->MODE.BF.PAD = 1;
    ethmac_reg->MODE.BF.HUGEN = 1;
    ethmac_reg->MODE.BF.CRCEN = 1;
    ethmac_reg->MODE.BF.FULLD = (DUPLEX_FULL == phydev->duplex) ? 1 : 0;
    ethmac_reg->MODE.BF.IFG = 0;
    ethmac_reg->MODE.BF.PRO = 0;
    ethmac_reg->MODE.BF.BRO = 1;
    ethmac_reg->MODE.BF.NOPRE = 0;
    ethmac_reg->MODE.BF.TXEN = 0;
    ethmac_reg->MODE.BF.RXEN = 0;

    ethmac_reg->MAC_ADDR0.BF.MAC_B5 = phydev->mac_addr[5];
    ethmac_reg->MAC_ADDR0.BF.MAC_B4 = phydev->mac_addr[4];
    ethmac_reg->MAC_ADDR0.BF.MAC_B3 = phydev->mac_addr[3];
    ethmac_reg->MAC_ADDR0.BF.MAC_B2 = phydev->mac_addr[2];
    ethmac_reg->MAC_ADDR1.BF.MAC_B1 = phydev->mac_addr[1];
    ethmac_reg->MAC_ADDR1.BF.MAC_B0 = phydev->mac_addr[0];

//    ethmac_reg->MAC_ADDR0.WORD = 0x33332211;
//    ethmac_reg->MAC_ADDR1.WORD = 0x1122;

    //bflb_IRQ_Enable(ETHMAC_IRQn);
    //bflb_IRQ_Cfg(ETHMAC_IRQn, 7, ETHMAC_IRQHandler);
    Interrupt_Handler_Register(ETHMAC_IRQn, ETHMAC_IRQHandler);
    System_NVIC_SetPriority(ETHMAC_IRQn,7,1);
    CPU_Interrupt_Enable(ETHMAC_IRQn);

    return 0;
}

int ETHMAC_Cfg_BD(void)
{
    int err = 0;

    thiz = &ethHandle;

    /* init the BDs in ethmac with buffer address */
    /*
     * TODO: hard code for debugging on FPGA ONLY!!!
     * MUST check why !!!
     */
#if 1
    err = ETHMAC_DMADescListInit(thiz, (uint8_t *)ethTxBuff, ETH_TXBUFNB, (uint8_t *)ethRxBuff, ETH_RXBUFNB);
#else
    err = ETHMAC_DMADescListInit(thiz, (uint8_t *)0xb0000000, ETH_TXBUFNB, (uint8_t *)0xb0100000, ETH_RXBUFNB);
#endif

    return err;
}

int ETHMAC_Transmit_Enable(void)
{
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    ethmac_reg->MODE.BF.TXEN = 1;

    return 0;
}

int ETHMAC_Receive_Enable(void)
{
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    ethmac_reg->MODE.BF.RXEN = 1;

    return 0;
}

void ETHMAC_IntMask(ETHMAC_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;

    /* Check the parameters */
    //CHECK_PARAM(IS_ETHMAC_INT_TYPE(intType));
    //CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    switch(intType)
    {
        case ETHMAC_INT_TX:
            tmpVal = BL_RD_REG(ETHMAC_BASE, ETHMAC_INT_MASK);
            if(intMask == MASK){
                /* Disable this interrupt */
                BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_MASK, BL_SET_REG_BIT(tmpVal, ETHMAC_TXB_M));
            }else{
                /* Enable this interrupt */
                BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_MASK, BL_CLR_REG_BIT(tmpVal, ETHMAC_TXB_M));
            }
            break;

        case ETHMAC_INT_RX:
            tmpVal = BL_RD_REG(ETHMAC_BASE, ETHMAC_INT_MASK);
            if(intMask == MASK){
                /* Disable this interrupt */
                BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_MASK, BL_SET_REG_BIT(tmpVal, ETHMAC_RXB_M));
            }else{
                /* Enable this interrupt */
                BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_MASK, BL_CLR_REG_BIT(tmpVal, ETHMAC_RXB_M));
            }
            break;

        case ETHMAC_INT_ALL:
            tmpVal = BL_RD_REG(ETHMAC_BASE, ETHMAC_INT_MASK);
            if(intMask == MASK){
                /* mask all interrupts */
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_TXB_M);
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_RXB_M);
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_TXE_M);
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_RXE_M);
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_BUSY_M);
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_TXC_M);
                tmpVal = BL_SET_REG_BIT(tmpVal, ETHMAC_RXC_M);
                BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_MASK, tmpVal);
            }else{
                /* unmask all interrupts */
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_TXB_M);
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_RXB_M);
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_TXE_M);
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_RXE_M);
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_BUSY_M);
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_TXC_M);
                tmpVal = BL_CLR_REG_BIT(tmpVal, ETHMAC_RXC_M);
                BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_MASK, tmpVal);
            }
            break;

        default:
            break;
    }
}

/****************************************************************************//**
 * @brief  Initialize EMAC TX RX MDA buffer
 *
 * @param  handle: EMAC handle pointer
 * @param  txBuff: TX buffer
 * @param  txBuffCount: TX buffer count
 * @param  rxBuff: RX buffer
 * @param  rxBuffCount: RX buffer count
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
int ETHMAC_DMADescListInit(ETHMAC_Handle_Type *handle,uint8_t *txBuff, uint32_t txBuffCount,uint8_t *rxBuff, uint32_t rxBuffCount)
{
    uint32_t i = 0;
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    /* Set the Ethernet handler env */
    handle->bd = (ETHMAC_BD_Desc_Type *)(ETHMAC_BASE + BD_DESC_OFFSET);
    handle->txIndexEMAC = 0;
    handle->txIndexCPU  = 0;
    handle->txBuffLimit = txBuffCount - 1;
    /* The receive descriptors' address starts right after the last transmit BD. */
    handle->rxIndexEMAC = txBuffCount;
    handle->rxIndexCPU  = txBuffCount;
    handle->rxBuffLimit = txBuffCount + rxBuffCount - 1;

    /* Fill each DMARxDesc descriptor with the right values */
    for(i=0; i < txBuffCount; i++){
        /* Get the pointer on the ith member of the Tx Desc list */
        handle->bd[i].Buffer= (NULL == txBuff) ? NULL : (uint32_t)(txBuff+(ETH_MAX_PACKET_SIZE*i));
        handle->bd[i].C_S_L = 0;
    }
    /* For the last TX DMA Descriptor, it should be wrap back */
    handle->bd[handle->txBuffLimit].C_S_L |= ETHMAC_BD_FIELD_MSK(TX_WR);

