bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_ethmac.c
    for(i = txBuffCount; i < (txBuffCount + rxBuffCount); i++){
        /* Get the pointer on the ith member of the Rx Desc list */
        handle->bd[i].Buffer= ( NULL == rxBuff) ? NULL : (uint32_t)(rxBuff+(ETH_MAX_PACKET_SIZE*(i - txBuffCount)));
        handle->bd[i].C_S_L = (ETH_MAX_PACKET_SIZE << 16)  |
                               ETHMAC_BD_FIELD_MSK(RX_IRQ) |
                               ETHMAC_BD_FIELD_MSK(RX_E);
    }
    /* For the last RX DMA Descriptor, it should be wrap back */
    handle->bd[handle->rxBuffLimit].C_S_L |= ETHMAC_BD_FIELD_MSK(RX_WR);

    /* For the TX DMA Descriptor, it will wrap to 0 according to EMAC_TX_BD_NUM*/
    ethmac_reg->TX_BD_NUM.BF.TXBDNUM = txBuffCount;

    return 0;
}

int ETHMAC_BD_TX_enqueue(uint32_t flags, uint32_t len, const uint8_t *data_in, bool no_copy)
{
    int err = 0;
    ETHMAC_BD_Desc_Type *DMADesc;

    DMADesc = &thiz->bd[thiz->txIndexCPU];

    if ((uint32_t)(-1) == flags) {
        flags = ETHMAC_TX_COMMON_FLAGS;
    }

    if(DMADesc->C_S_L & ETHMAC_BD_FIELD_MSK(TX_RD)){
        /* no free BD, lost sync with DMA TX? */
        err = -16; /* -EBUSY */
    }else{
        if (true == no_copy) {
            DMADesc->Buffer = (uint32_t)data_in;
        } else {
            memcpy((void *)(DMADesc->Buffer + EMAC_DMA_MAPPING_OFFSET), data_in, len);
            //memcpy((void *)(DMADesc->Buffer), data_in, len);
        }
#if CPU_CA5
        //asm volatile ("dsb"::);
#endif
        __DSB();
        /* move to next TX BD */
        if ((++thiz->txIndexCPU) > thiz->txBuffLimit) {
            /* wrap back */
            thiz->txIndexCPU = 0;
            /* the last BD */
            flags |= ETHMAC_BD_FIELD_MSK(TX_WR);
        }

        __DSB();
        //asm volatile ("DSB");
        DMADesc->C_S_L = flags | (len << BD_TX_LEN_POS);
    }

    return err;
}

/* this func will be called in ISR */
int ETHMAC_BD_TX_dequeue(uint32_t index)
{
    int err = 0;
    ETHMAC_BD_Desc_Type *DMADesc;

    thiz->txIndexEMAC = index;
    DMADesc = &thiz->bd[thiz->txIndexEMAC];
    /* release this tx BD to SW (HW will do this) */
    //DMADesc->C_S_L &= ETHMAC_BD_FIELD_UMSK(TX_RD);

    return err;
}

void ETHMAC_BD_TX_onErr(uint32_t index)
{
    /* handle error */
    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(TX_UR)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(TX_RTRY)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(TX_RL)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(TX_LC)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(TX_DF)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(TX_CS)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    thiz->bd[index].C_S_L &= ~0xff;
}

int ETHMAC_BD_RX_enqueue(uint32_t index)
{
    int err = 0;

    thiz->rxIndexEMAC = index;

    return err;
}

int ETHMAC_BD_RX_dequeue(uint32_t flags, uint32_t *len, uint8_t *data_out)
{
    int err = 0;
    ETHMAC_BD_Desc_Type *DMADesc;

    DMADesc = &thiz->bd[thiz->rxIndexCPU];

    if(DMADesc->C_S_L & ETHMAC_BD_FIELD_MSK(RX_E)){
        /* current RX BD is empty */
        err = -16;
        *len = 0;

        /* move to next RX BD */
        if ((++thiz->rxIndexCPU) > thiz->rxBuffLimit) {
            /* wrap back */
            thiz->rxIndexCPU = thiz->txBuffLimit + 1;
        }
    }else{
        *len = (thiz->bd[thiz->rxIndexCPU].C_S_L & ETHMAC_BD_FIELD_MSK(RX_LEN)) >> BD_RX_LEN_POS;
        if (data_out) {
#if __riscv_xlen == 64
            csi_dcache_invalid_range((uint64_t *)(DMADesc->Buffer + EMAC_DMA_MAPPING_OFFSET), (int64_t)*len);
#endif
#if __riscv_xlen == 32
            csi_dcache_invalid_range((uint32_t *)(DMADesc->Buffer + EMAC_DMA_MAPPING_OFFSET), (int32_t)*len);
#endif
            memcpy(data_out, (const void *)(DMADesc->Buffer + EMAC_DMA_MAPPING_OFFSET), *len);
            //memcpy(data_out, (const void *)(DMADesc->Buffer), *len);
        }

        /* move to next RX BD */
        if ((++thiz->rxIndexCPU) > thiz->rxBuffLimit) {
            /* the last BD */
            DMADesc->C_S_L |= ETHMAC_BD_FIELD_MSK(RX_WR);
            /* wrap back */
            thiz->rxIndexCPU = thiz->txBuffLimit + 1;
        }

        /* RX BD can be used for another receive now */
        DMADesc->C_S_L |= ETHMAC_BD_FIELD_MSK(RX_E);
    }

    return err;
}

uint32_t ETHMAC_BD_Get_CurActive(ETHMAC_BD_TYPE_e bdt)
{
    uint32_t bd = 0;
    ethmac_reg_t *ethmac_reg = (ethmac_reg_t*)ETHMAC_BASE;

    bd = ethmac_reg->TX_BD_NUM.WORD;

    if (bdt == EMAC_BD_TYPE_TX) {
        bd &= ETHMAC_TXBDPTR_MSK;
        bd >>= ETHMAC_TXBDPTR_POS;
    }

    if (bdt == EMAC_BD_TYPE_RX) {
        bd &= ETHMAC_RXBDPTR_MSK;
        bd >>= ETHMAC_RXBDPTR_POS;
    }

    return bd;
}

void ETHMAC_BD_RX_onErr(uint32_t index)
{
    /* handle error */
    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(RX_OR)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(RX_RE)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(RX_DN)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(RX_TL)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(RX_CRC)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    if (thiz->bd[index].C_S_L & ETHMAC_BD_FIELD_MSK(RX_LC)) {
        printf("%s:%d\r\n", __func__, __LINE__);
    }

    thiz->bd[index].C_S_L &= ~0xff;
    /* RX BD is ready for RX */
    thiz->bd[index].C_S_L |= ETHMAC_BD_FIELD_MSK(RX_E);
}

static int ETHMAC_Handle_RX_Buffer(void)
{
    static int buf_cnt = 0;
    int rx_buf_len;
    bd_reg_t *bd_reg;
    uint32_t dest_addr;

