bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_ethmac.c
    /* RX BD */
    bd_reg = (bd_reg_t*)(ETHMAC_BASE + BD_DESC_OFFSET) + NUM_TX_BD + buf_cnt;
    rx_buf_len = bd_reg->BD_Config.BD_RX.LEN - 4;   /* exclude 4 byte FCS */

    printf("receive buffer[%d], len %d\r\n", buf_cnt, rx_buf_len);

    bd_reg->BD_Config.BD_RX.E = 1;  /* re-enable this RX BD */


    /* hack dest addr to linux host */
    dest_addr = 0x70030000 + buf_cnt * 0x1000;

    memcpy((void*)dest_addr, (void*)0x70034000, 12);
#if 0
    *dest_addr = 0x80002766;
    dest_addr++;
    *dest_addr = (*dest_addr && 0x0000FFFF) | (0x3653 << 16);
#endif

    /* TX BD */
    bd_reg = (bd_reg_t*)(ETHMAC_BASE + BD_DESC_OFFSET) + buf_cnt;
    bd_reg->BD_Config.BD_TX.LEN = rx_buf_len;
    bd_reg->BD_Config.BD_TX.RD = 1;

    

    buf_cnt = (buf_cnt + 1) & 0x3;
    
    return 0;
}

static void ETHMAC_TX_Done_Callback(void)
{
    uint32_t index = 0;

    index = ETHMAC_BD_Get_CurActive(EMAC_BD_TYPE_TX);

#if (EMAC_TEST_ROLE & TEST_ROLE_TX)
    tx_pkg_cnt ++;
#endif

    ETHMAC_BD_TX_dequeue(index);
}

static void ETHMAC_TX_Error_Callback(void)
{
    uint32_t index = 0;

#if (EMAC_TEST_ROLE & TEST_ROLE_TX)
    tx_err_cnt ++;
#endif

    index = ETHMAC_BD_Get_CurActive(EMAC_BD_TYPE_TX);

    ETHMAC_BD_TX_onErr(index);
}

static void ETHMAC_RX_Done_Callback(void)
{
    uint32_t index = 0;

    index = ETHMAC_BD_Get_CurActive(EMAC_BD_TYPE_RX);

    ETHMAC_BD_RX_enqueue(index);
}

static void ETHMAC_RX_Error_Callback(void)
{
    uint32_t index;

    index = ETHMAC_BD_Get_CurActive(EMAC_BD_TYPE_RX);

#if (EMAC_TEST_ROLE & TEST_ROLE_RX)
    rx_err_cnt ++;
#endif

    ETHMAC_BD_RX_onErr(index);
}

static void ETHMAC_RX_Busy_Callback(void)
{
   printf("%s:%d\r\n", __func__, __LINE__);
}

void ETHMAC_IRQHandler(void)
{
    uint32_t ethmac_int;

    ethmac_int = BL_RD_REG(ETHMAC_BASE, ETHMAC_INT_SOURCE);

    /* clear interrupts */
    BL_WR_REG(ETHMAC_BASE, ETHMAC_INT_SOURCE, ethmac_int);

	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_TXB)) {
		ETHMAC_TX_Done_Callback();
    }
	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_TXE)) {
		ETHMAC_TX_Error_Callback();
    }
	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_RXB)) {
		ETHMAC_RX_Done_Callback();
    }
	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_RXE)) {
		ETHMAC_RX_Error_Callback();
    }
	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_BUSY)) {
		ETHMAC_RX_Busy_Callback();
    }
	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_TXC)) {
        /* TODO */
    }
	if (BL_IS_REG_BIT_SET(ethmac_int, ETHMAC_RXC)) {
        /* TODO */
    }
}

